M9/load-testing-taurus/scenarios/product-stress-wave-test.yml
# ─────────────────────────────────────────────────────────────────────────────
# Migracja z Artillery: M9/load-testing-artillery/scenarios/product-stress-wave-test.yml
#
# Wielofazowy (~9 min) test "falowy" z trzema eskalujacymi szczytami: 25 -> 45 -> 70 RPS.
#
# ── KLUCZOWE ROZNICE Artillery -> Taurus (wykryte przy weryfikacji) ─────────────
#  1) SEKWENCYJNOSC FAZ: w Artillery `phases` wykonuja sie PO KOLEI (to tworzy fale
#     w czasie). W Taurus bloki `execution` startuja ROWNOLEGLE. Aby odtworzyc
#     sekwencje, kazdy blok dostaje `delay` = skumulowany czas startu danej fazy.
#     Dzieki temu fazy "kafelkuja" os czasu jedna po drugiej (jak w Artillery).
#  2) ROTACJA ZMIENNYCH: Taurus/JMeter NIE rotuje zmiennych-list (${productId} z
#     listy YAML renderuje sie jako literal "[1, 2, 3...]" -> Illegal character).
#     Uzywamy funkcji JMeter __Random(min,max) per-request - odpowiednik losowania
#     z puli w Artillery.
#  3) CONCURRENCY: Artillery maxVusers=2000 to twardy limit; w JMeter 2000 watkow
#     to thundering herd. Kontrolujemy NATEZENIE przez `throughput` (RPS docelowy
#     = arrivalRate z Artillery), a `concurrency` ustawiamy na rozsadny limit 200.
#
# Mapowanie:
#   Artillery arrivalRate / rampTo  -> Taurus throughput (RPS) + ramp-up
#   Faza stala (bez rampTo)         -> hold-for
#   Kolejnosc faz (sekwencja)       -> delay (skumulowany offset startu)
#
# Target: LAN IP (localhost:3000 bywa przeslaniany przez hostowy dev-server).
# ─────────────────────────────────────────────────────────────────────────────

execution:
# Faza 00: Rozgrzewka (45s) | arrivalRate 2 -> 5 | start @0s
- concurrency: 200
  throughput: 5
  ramp-up: 45s
  delay: 0s
  scenario: wave-traffic-pattern

# Faza 01: Fala 1 narastanie (60s) | 5 -> 25 | start @45s
- concurrency: 200
  throughput: 25
  ramp-up: 60s
  delay: 45s
  scenario: wave-traffic-pattern

# Faza 02: Fala 1 szczyt hold (40s) | 25 | start @105s
- concurrency: 200
  throughput: 25
  hold-for: 40s
  delay: 105s
  scenario: wave-traffic-pattern

# Faza 03: Spadek po fali 1 (40s) | 25 -> 8 | start @145s
- concurrency: 200
  throughput: 8
  ramp-up: 40s
  delay: 145s
  scenario: wave-traffic-pattern

# Faza 04: Dolina 1 (30s) | 8 | start @185s
- concurrency: 200
  throughput: 8
  hold-for: 30s
  delay: 185s
  scenario: wave-traffic-pattern

# Faza 05: Fala 2 silniejsze narastanie (70s) | 8 -> 45 | start @215s
- concurrency: 200
  throughput: 45
  ramp-up: 70s
  delay: 215s
  scenario: wave-traffic-pattern

# Faza 06: Fala 2 szczyt hold (45s) | 45 | start @285s
- concurrency: 200
  throughput: 45
  hold-for: 45s
  delay: 285s
  scenario: wave-traffic-pattern

# Faza 07: Ostry spadek (35s) | 45 -> 10 | start @330s
- concurrency: 200
  throughput: 10
  ramp-up: 35s
  delay: 330s
  scenario: wave-traffic-pattern

# Faza 08: Dolina 2 gleboki spadek (40s) | 5 | start @365s
- concurrency: 200
  throughput: 5
  hold-for: 40s
  delay: 365s
  scenario: wave-traffic-pattern

# Faza 09: Fala 3 blyskawiczny spike, najwyzszy (50s) | 5 -> 55 | start @405s
#   (obnizone z 70 -> 55, by uniknac spietrzenia watkow JMeter na ciezkim /products)
- concurrency: 200
  throughput: 55
  ramp-up: 50s
  delay: 405s
  scenario: wave-traffic-pattern

# Faza 10: Fala 3 szczyt maksymalny hold (30s) | 55 | start @455s
- concurrency: 200
  throughput: 55
  hold-for: 30s
  delay: 455s
  scenario: wave-traffic-pattern

# Faza 11: Wygaszanie - dlugi ramp down (60s) | 55 -> 2 | start @485s
- concurrency: 100
  throughput: 2
  ramp-up: 60s
  delay: 485s
  scenario: wave-traffic-pattern

settings:
  artifacts-dir: reports/%Y-%m-%d_%H-%M-%S.%f

scenarios:
  wave-traffic-pattern:
    default-address: http://192.168.0.151:3000
    requests:
    # ── Browse products collection (Artillery weight 4) ──
    - url: /products
      method: GET
      label: Browse - all products
      think-time: 2s
    - url: /products/${__Random(1,5)}
      method: GET
      label: Browse - product by id
      think-time: 1s

    # ── Analytics dashboards / heavy queries (Artillery weight 3) ──
    - url: /top/products-by-category/${__Random(1,8)}
      method: GET
      label: Analytics - top by category
      think-time: 1s
    - url: /top/customers-by-total-spent
      method: GET
      label: Analytics - top customers
      think-time: 1s
    - url: /orders/delivered
      method: GET
      label: Analytics - delivered orders
      think-time: 2s

    # ── Create and manage product lifecycle (Artillery weight 2) ──
    - url: /products
      method: POST
      label: Lifecycle - create product
      headers:
        Content-Type: application/json
      body:
        name: "Wave Stress Product"
        price: 49.99
        stock: 100
        category_id: 3
      extract-jsonpath:
        createdProductId:
          jsonpath: $.id
          default: 1
      think-time: 1s
    - url: /products/${createdProductId}
      method: GET
      label: Lifecycle - get created product
      think-time: 1s
    - url: /products/${createdProductId}
      method: DELETE
      label: Lifecycle - delete product

    # ── Error sprinkle (Artillery weight 1) ──
    - url: /inject-error
      method: GET
      label: Errors - inject random error
      think-time: 1s
    - url: /products/999999999
      method: GET
      label: Errors - missing product (404/500)
      think-time: 1s
    - url: /error
      method: GET
      label: Errors - thrown exception (500)